In [13]:
import pandas as pd
import os

In [14]:
# Import the data. Create a DataFrame
student_data = os.path.join(r"C:\Users\15152\Desktop\DataClass\Assignments\School_District_Analysis\new_full_student_data.csv")
student_df = pd.read_csv(student_data)

In [15]:
# Confirm that Pandas correctly imported the data
student_df.head()

,student_id,student_name,grade,school_name,reading_score,math_score,school_type,school_budget
0,103880842,Travis Martin,9th,Sullivan High School,59.0,88.2,Public,961125
1,45069750,Michael Brown,9th,Dixon High School,94.7,73.5,Charter,870334
2,45024902,Gabriela Lucero,9th,Wagner High School,89.0,70.4,Public,846745
3,62582498,Susan Richardson,9th,Silva High School,69.7,80.3,Public,991918
4,16437227,Sherry Davis,11th,Bowers High School,NaN,27.5,Public,848324

In [16]:
# Generate the summary statistics.
student_df.describe()

         student_id  reading_score    math_score  school_budget
count  1.951400e+04   17546.000000  18532.000000   19514.000000
mean   6.975630e+07      72.407854     64.628972  893738.174080
std    3.459615e+07      15.206922     15.800076   53975.504589
min    1.000906e+07      10.500000      3.700000  817615.000000
25%    3.962676e+07      62.300000     54.400000  846745.000000
50%    6.972680e+07      73.800000     65.200000  893368.000000
75%    9.949126e+07      84.000000     75.900000  956438.000000
max    1.299997e+08     100.000000    100.000000  991918.000000

In [17]:
# Display the mean math score by using the mean function
student_df.mean()

C:\Users\15152\AppData\Local\Temp\ipykernel_24004\933271317.py:2: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  student_df.mean()

student_id       6.975630e+07
reading_score    7.240785e+01
math_score       6.462897e+01
school_budget    8.937382e+05
dtype: float64

In [20]:
# Store the minimum reading score in min_reading_score.
min_reading_score = student_df['reading_score'].min()
min_reading_score

10.5